warning_1 = "\n---------------------------------------\nВ расписании могут встретиться пары, " \
            "помеченные значком (?). Это значит, что, возможно, мне не удалось корректно обработать" \
            " и показать вам эту позицию в расписании. В таком случае стоит свериться с оригиналом" \
            " расписания, представленным здесь: bntu.by/raspisanie "

welcome = "Доброго времени суток! \nЯ помогу вам разобраться с расписанием.\n\n" \
          "Для начала вам необходимо указать номер вашей группы."\
          "\n\nДля этого воспользуйтесь командой\n   /set <номер группы>"

hlp = "Список команд:   "
hlp += "\n   /start - начало работы с ботом"
hlp += "\n   /set <номер_группы> - так вы укажете вашу группу"
hlp += "\n   /groups - узнать, какие группы мы обслуживаем"
hlp += "\n   /today, /yesterday, /tomorrow - вывод расписание на сегодня, вчера и завтра соответственно"
hlp += "\n   /schedule - расписание на всю неделю"
hlp += "\n   /week - узнать, какая сейчас неделя (1-я или 2-я)"
hlp += "\n   /mon, /tue, /wed, /thu, /fri, /sat - вывод расписания на соотв. день недели"
hlp += "\n   /help - справка о командах (которую вы сейчас наблюдаете)"
